{
    "activation_function": "gelu_new",
    "architectures": [
      "GPT2LMHeadModel"
    ],
    "attn_pdrop": 0.1,
    "bos_token_id": 0,
    "embd_pdrop": 0.1,
    "eos_token_id": 0,
    "initializer_range": 0.02,
    "layer_norm_epsilon": 1e-05,
    "model_type": "gpt2",
    "n_ctx": 1024,
    "n_embd": 1152,
    "n_head": 18,
    "n_layer": 12,
    "n_inner": null,
    "n_positions": 1024,
    "output_past": true,
    "reorder_and_upcast_attn": true,
    "resid_pdrop": 0.1,
    "scale_attn_by_inverse_layer_idx": true,
    "scale_attn_weights": true,
    "summary_activation": null,
    "summary_first_dropout": 0.1,
    "summary_proj_to_labels": true,
    "summary_type": "cls_index",
    "summary_use_proj": true,
    "task_specific_params": {
      "text-generation": {
        "do_sample": true,
        "max_length": 50
      }
    },
    "torch_dtype": "float32",
    "use_cache": true,
    "vocab_size": 32768,
    "output_attentions": false,
    "output_hidden_states": false
}